---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.Equal
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.Equal

The field value is equal to the specified value.